In [3]:
import pandas as pd 
from pathlib import Path
comp_dir = Path('data/store-sales-time-series-forecasting')
train = pd.read_csv(comp_dir / 'train_sample_201516.csv')
stores = pd.read_csv(comp_dir / 'stores.csv')
oil = pd.read_csv(comp_dir / 'oil.csv')
transactions = pd.read_csv(comp_dir / 'transactions.csv')
holidays_events = pd.read_csv(comp_dir / 'holidays_events.csv')

In [27]:
from pingouin import ttest
train.head()

,id,date,store_nbr,family,sales,onpromotion,year,month,day
0,1297296,2015-01-01,1,AUTOMOTIVE,0.0,0,2015,1,1
1,1297297,2015-01-01,1,BABY CARE,0.0,0,2015,1,1
2,1297298,2015-01-01,1,BEAUTY,0.0,0,2015,1,1
3,1297299,2015-01-01,1,BEVERAGES,0.0,0,2015,1,1
4,1297300,2015-01-01,1,BOOKS,0.0,0,2015,1,1

In [28]:
train.head()

,id,date,store_nbr,family,sales,onpromotion,year,month,day
0,1297296,2015-01-01,1,AUTOMOTIVE,0.0,0,2015,1,1
1,1297297,2015-01-01,1,BABY CARE,0.0,0,2015,1,1
2,1297298,2015-01-01,1,BEAUTY,0.0,0,2015,1,1
3,1297299,2015-01-01,1,BEVERAGES,0.0,0,2015,1,1
4,1297300,2015-01-01,1,BOOKS,0.0,0,2015,1,1

In [29]:
month = 7

new_df = train.loc[(train['month']==month) & (train['family'].isin(['DAIRY', 'CLEANING'])), :].reset_index(drop=True)
new_df.groupby('family')['sales'].agg('mean')

family
CLEANING    1104.935783
DAIRY        793.758363
Name: sales, dtype: float64

In [30]:
new_df.loc[df_data['family'] == 'DAIRY']['sales'].reset_index(drop=True)

0       894.0
1       767.0
2      1330.0
3       940.0
4      1270.0
        ...
198    1333.0
199       0.0
200     888.0
201     749.0
202    2402.0
Name: sales, Length: 203, dtype: float64

In [33]:
wide_df = pd.DataFrame({
        'DAIRY' : new_df.loc[new_df['family'] == 'DAIRY']['sales'].reset_index(drop=True),
        'CLEANING' : new_df.loc[new_df['family'] == 'CLEANING']['sales'].reset_index(drop=True)
})
wide_df.head()

   DAIRY  CLEANING
0  884.0    1009.0
1  281.0     976.0
2  609.0    3021.0
3  404.0    1021.0
4  337.0     894.0

In [34]:
from pingouin import ttest
ttest(wide_df['DAIRY'], wide_df['CLEANING'], correction='auto')

,T,dof,alternative,p-val,CI95%,cohen-d,BF10,power
T-test,-19.281548,6694,two-sided,1.145307e-80,"[-342.81, -279.54]",0.471264,7.265e+76,1.0

## 머신러닝 코드

In [1]:
import streamlit as st
import pandas as pd
import seaborn as sns
import numpy as np
from sklearn.ensemble import RandomForestRegressor
from sklearn.model_selection import train_test_split, RandomizedSearchCV
from sklearn.metrics import r2_score, mean_absolute_error
import plotly.graph_objects as go

In [13]:
train['store_nbr'].max()

54

In [4]:
df_merge = train.merge(transactions, how='left', on = ['date', 'store_nbr'])
df_merge.head(1)

,id,date,store_nbr,family,sales,onpromotion,year,month,day,transactions
0,1297296,2015-01-01,1,AUTOMOTIVE,0.0,0,2015,1,1,NaN

In [6]:
df_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1299078 entries, 0 to 1299077
Data columns (total 10 columns):
 #   Column        Non-Null Count    Dtype
---  ------        --------------    -----
 0   id            1299078 non-null  int64
 1   date          1299078 non-null  object
 2   store_nbr     1299078 non-null  int64
 3   family        1299078 non-null  object
 4   sales         1299078 non-null  float64
 5   onpromotion   1299078 non-null  int64
 6   year          1299078 non-null  int64
 7   month         1299078 non-null  int64
 8   day           1299078 non-null  int64
 9   transactions  1232385 non-null  float64
dtypes: float64(2), int64(6), object(2)
memory usage: 99.1+ MB

In [12]:
store_num = 2
data = df_merge.loc[df_merge['store_nbr'] == store_num, ['family', 'transactions', 'sales']].dropna()
data.dropna()

                             family  transactions       sales
2145                     AUTOMOTIVE        1859.0     5.00000
2146                      BABY CARE        1859.0     0.00000
2147                         BEAUTY        1859.0     6.00000
2148                      BEVERAGES        1859.0  1424.00000
2149                          BOOKS        1859.0     0.00000
...                             ...           ...         ...
1297687                     POULTRY        2941.0   566.97900
1297688              PREPARED FOODS        2941.0   163.18399
1297689                     PRODUCE        2941.0  3817.38100
1297690  SCHOOL AND OFFICE SUPPLIES        2941.0     1.00000
1297691                     SEAFOOD        2941.0    33.64300

[23925 rows x 3 columns]